{
  "expo": {
    "name": "Electro",
    "slug": "electro",
    "privacy": "public",
    "sdkVersion": "32.0.0",
    "platforms": [
      "ios",
      "android"
    ],
    "version": "1.0.0",
    "orientation": "portrait",
    "icon": "./assets/images/icon.png",
    "splash": {
      "image": "./assets/images/splash.png",
      "resizeMode": "contain",
      "backgroundColor": "#ffffff"
    },
    "updates": {
      "fallbackToCacheTimeout": 0
    },
    "assetBundlePatterns": [
      "**/*"
    ],
    "ios": {
      "supportsTablet": true
    },
    "description": "5/6/19: \n\n* Login screen\n    * for ease of testing, no password is required. \n    * You can enter a username to create a new user or pick a user you’ve previously created.\n* Map screen\n    * Currently pegged to a single location (in Concord NH). \n    * Listings in the database will show on map as markers. Click a marker to show station name (any other info can go in this popup eventually), and click on the popup to go the detail page for the listing.\n    * Coming “soon”: “find my location” button (blue dot); searching the map\n* List screen - lists all existing stations\n    * Downloads stations from website\n    * Lists stations created from the app. Stations created on the app do NOT post to the website. Also, they may not persist between launches. This will be fixed soon.\n    * We can change this list to show other info, like listing photo, etc.\n    * Coming later: filter stations by distance (i.e., only show nearby stations), and other filters.\n* Add Station screen\n    * For quickly creating a station in development, fields are filled out with placeholder info. Press “Clear” to clear all fields.\n    * Clicking submit adds the station to the database and opens the station detail screen.\n    * Address field searches google maps, and once an address is selected from the search, the new station receives the GPS coords of the address. This means that if you don’t select an address from that list (i.e., if you just type an address), the station won’t be saved with an actual location. Therefore…\n    * Coming soon/later: field validation, starting with “you must select an actual address”\n    * Coming soon/later: add photos to listing, and other fields (see website for current fields, not all these fields will be copied to the app)\n* Station detail screen (accessed by clicking on a station from the list, or adding a new station)\n    * Shows the image (this does work for stations downloaded from the existing website, but the current version of the app is fully local, and there’s no uploading of images yet)\n    * Shows info for the station, and contact buttons to email or call the provided info. These buttons should actually launch email/phone applications\n    * Delete button is for development purposes only. Soon, only the station’s “owner” will see a delete button.\n    * Coming soon: edit station\n* Profile Screen (“me”)\n    * Very basic user info. (Currently there's no way to set name, email, or phone for a user\n    * Currently \"My Stations\" actually shows all stations\n",
    "githubUrl": "https://github.com/tuzmusic/QMG-Electro"
  }
}